In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\ADMIN11\\Desktop\\csv\\BL-Flickr-Images-Book.csv")
df.head()

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

In [3]:
df.columns

Index(['Identifier', 'Edition Statement', 'Place of Publication',
       'Date of Publication', 'Publisher', 'Title', 'Author', 'Contributors',
       'Corporate Author', 'Corporate Contributors', 'Former owner',
       'Engraver', 'Issuance type', 'Flickr URL', 'Shelfmarks'],
      dtype='object')

In [4]:
df.shape

(8287, 15)

# Dropping unwanted columns

In [5]:
to_drop = ['Edition Statement','Corporate Author', 'Corporate Contributors','Former owner','Engraver','Shelfmarks']

In [6]:
df.drop(columns = to_drop , inplace = True)

In [7]:
#df.drop(to_drop, inplace = True, axis = 1)  # Aliter way of dropping columns

In [8]:
df.drop(['Author'], inplace = True, axis = 1)

In [9]:
df.head()

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Contributors,Issuance type,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,"FORBES, Walter.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"BLAZE DE BURY, Marie Pauline Rose - Baroness",monographic,http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"BLAZE DE BURY, Marie Pauline Rose - Baroness",monographic,http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","Appleyard, Ernest Silvanus.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","BROOME, John Henry.",monographic,http://www.flickr.com/photos/britishlibrary/ta...

# Regular expression
### The \d represents any digit, and {4} repeats this rule four times. The ^ character matches the start of a string, and the parentheses denote a capturing group, which signals to Pandas that we want to extract that part of the regex ###

In [10]:
regex = r'^(\d{4})'

In [11]:
extr = df['Date of Publication'].str.extract(r'^(\d{4})',expand = False)

In [12]:
extr.head()

0    1879
1    1868
2    1869
3    1851
4    1857
Name: Date of Publication, dtype: object

In [13]:
df['Date of Publication'] = pd.to_numeric(extr)
df['Date of Publication'].dtype

dtype('float64')

In [14]:
df['Date of Publication'].isnull().sum() / len(df)

0.11717147339205986

# Identifying unique cols and setting/changing the index of a dataframe

In [15]:
df['Identifier'].is_unique

True

In [1]:
#df.set_index('Identifier')

In [17]:
df.iloc[206]

Identifier                                                          77554
Place of Publication                                               London
Date of Publication                                                1848.0
Publisher                                                 Richard Bentley
Title                   Rambles in the romantic regions of the Hartz M...
Contributors                                  BECKWITH-LOHMEYER, Charles.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 206, dtype: object

In [18]:
# dropna will drop a row or a column
# axis can be index or column. whatever it is nan value would be evaluated in that index/column
# subset defines drop na to check in that specific column

In [2]:
#df.dropna(axis = 'index', how = 'any',subset = ['Publisher','Flickr URL','Date of Publication'])

In [20]:
df.dropna(axis = 'index', how = 'any')

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Contributors,Issuance type,Flickr URL
0,206,London,1879.0,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,"FORBES, Walter.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868.0,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"BLAZE DE BURY, Marie Pauline Rose - Baroness",monographic,http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869.0,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"BLAZE DE BURY, Marie Pauline Rose - Baroness",monographic,http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851.0,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","Appleyard, Ernest Silvanus.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857.0,Wertheim & Macintosh,"[The World in which I live, and my place in it...","BROOME, John Henry.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
...,...,...,...,...,...,...,...,...
8279,4156359,New York,1898.0,G. P. Putnam's Sons,History of the People of the Netherlands ... T...,"BIERSTADT, Oscar A.|PUTNAM, Ruth.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8280,4157746,London,1811.0,F. C. and J. Rivington,"The New Chronicles of England and France, in t...","ELLIS, Henry - Sir, Principal Librarian of the...",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8281,4157862,Newcastle-upon-Tyne,1867.0,T. Fordyce,"Local Records; or, Historical Register of rema...","SYKES, John - Bookseller, of Newcastle-upon-Tyne",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8283,4158128,Derby,1831.0,M. Mozley & Son,The History and Gazetteer of the County of Der...,"NOBLE, Thomas.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8285,4159587,Newcastle upon Tyne,1834.0,Mackenzie & Dent,"An historical, topographical and descriptive v...","ROSS, M. - of Durham",monographic,http://www.flickr.com/photos/britishlibrary/ta...

# how to use replace

In [21]:
df.replace('Newcastle-upon-Tyne','London',inplace = True)

In [22]:
df.shape

(8287, 8)

In [23]:
df.dropna(axis = 'index', how = 'any')

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Contributors,Issuance type,Flickr URL
0,206,London,1879.0,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,"FORBES, Walter.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868.0,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"BLAZE DE BURY, Marie Pauline Rose - Baroness",monographic,http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869.0,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"BLAZE DE BURY, Marie Pauline Rose - Baroness",monographic,http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851.0,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","Appleyard, Ernest Silvanus.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857.0,Wertheim & Macintosh,"[The World in which I live, and my place in it...","BROOME, John Henry.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
...,...,...,...,...,...,...,...,...
8279,4156359,New York,1898.0,G. P. Putnam's Sons,History of the People of the Netherlands ... T...,"BIERSTADT, Oscar A.|PUTNAM, Ruth.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8280,4157746,London,1811.0,F. C. and J. Rivington,"The New Chronicles of England and France, in t...","ELLIS, Henry - Sir, Principal Librarian of the...",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8281,4157862,London,1867.0,T. Fordyce,"Local Records; or, Historical Register of rema...","SYKES, John - Bookseller, of Newcastle-upon-Tyne",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8283,4158128,Derby,1831.0,M. Mozley & Son,The History and Gazetteer of the County of Der...,"NOBLE, Thomas.",monographic,http://www.flickr.com/photos/britishlibrary/ta...
8285,4159587,Newcastle upon Tyne,1834.0,Mackenzie & Dent,"An historical, topographical and descriptive v...","ROSS, M. - of Durham",monographic,http://www.flickr.com/photos/britishlibrary/ta...

In [24]:
df.replace('New York', 'new_york', inplace= True)

In [25]:
df.iloc[8279]

Identifier                                                        4156359
Place of Publication                                             new_york
Date of Publication                                                1898.0
Publisher                                             G. P. Putnam's Sons
Title                   History of the People of the Netherlands ... T...
Contributors                            BIERSTADT, Oscar A.|PUTNAM, Ruth.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 8279, dtype: object

# New dataset

In [101]:
import pandas as pd
import numpy as np

In [102]:
senior = {'first':['sachin','dravid','laxman','azhar','ganguly','missing'],
          'last':['tendulkar','rahul','pandey','mohd','saurav','missing'],
         'place':['1','2','missing','4','5','6',],
         'skill':['bat','bat','missing','bat','cap',np.nan]
         }

In [103]:
df = pd.DataFrame(senior)

In [104]:
df

     first       last    place    skill
0   sachin  tendulkar        1      bat
1   dravid      rahul        2      bat
2   laxman     pandey  missing  missing
3    azhar       mohd        4      bat
4  ganguly     saurav        5      cap
5  missing    missing        6      NaN

In [110]:
df.replace('missing',np.nan, inplace = True)

In [113]:
df.head(10)

     first       last place skill
0   sachin  tendulkar     1   bat
1   dravid      rahul     2   bat
2   laxman     pandey   NaN   NaN
3    azhar       mohd     4   bat
4  ganguly     saurav     5   cap

In [114]:
df.dtypes

first    object
last     object
place    object
skill    object
dtype: object

In [115]:
df.dropna(axis = 'index', how = 'any', inplace = True)

In [116]:
df

     first       last place skill
0   sachin  tendulkar     1   bat
1   dravid      rahul     2   bat
3    azhar       mohd     4   bat
4  ganguly     saurav     5   cap

In [89]:
# so either missing or Na can take np.nan value 
# both are not working simultaneously

In [90]:
#df['place'] = df['place'].astype(float)

In [91]:
df['place'].is_unique

True

In [92]:
df['place'].unique()

array(['1', '2', 'missing', '4', '5', '6'], dtype=object)

In [100]:
df= df.replace('missing',np.nan)

In [93]:
#df.replace('missing',0,inplace = True)

In [94]:
df['place'] = df['place'].astype(float)

In [95]:
df['place'].mean()

3.0

In [96]:
#df1 = df.dropna(axis = 'columns', how = 'any')

In [97]:
#df1

In [98]:
df = df.dropna()

In [99]:
df

     first       last  place skill
0   sachin  tendulkar    1.0   bat
1   dravid      rahul    2.0   bat
2   laxman     pandey    0.0     0
3    azhar       mohd    4.0   bat
4  ganguly     saurav    5.0   cap